//// 
// Copyright (c) 2018, Intel Corporation.
// SPDX-License-Identifier: BSD-3-Clause
////

#langdef en "English"

#string STR_DIAGNOSTIC_QUICK_SUCCESS  #language en "The quick health check succeeded."
#string STR_DIAGNOSTIC_UNMANAGEBALE_DIMM_SUBSYSTEM_VENDOR_ID  #language en "The quick health check detected that Apache Pass DIMM %ls is not manageable because subsystem vendor ID 0x%04x is not supported."
#string STR_DIAGNOSTIC_UNMANAGEBALE_DIMM_SUBSYSTEM_DEVICE_ID  #language en "The quick health check detected that Apache Pass DIMM %ls is not manageable because subsystem device ID 0x%04x is not supported."
#string STR_DIAGNOSTIC_UNMANAGEBALE_DIMM_FW_API_VERSION  #language en "The quick health check detected that Apache Pass DIMM %ls is not manageable because firmware API version %ls is not supported."
#string STR_DIAGNOSTIC_BAD_HEALTH_STATE  #language en "The quick health check detected that Apache Pass DIMM %ls is reporting a bad health state %ls."
#string STR_DIAGNOSTIC_MEDIA_TEMP_EXCEEDS_ALARM_THR  #language en "The quick health check detected that Apache Pass DIMM %ls is reporting a media temperature of %d C which is above the alarm threshold %d C."
#string STR_DIAGNOSTIC_SPARE_CAPACITY_BELOW_ALARM_THR  #language en "The quick health check detected that Apache Pass DIMM %ls is reporting remaining spare capacity at %d%% which is less than the alarm threshold %d%%."
#string STR_DIAGNOSTIC_PERCENTAGE_USED_EXCEEDS_THR  #language en "The quick health check detected that Apache Pass DIMM %ls is reporting percentage used at %d%% which is above the recommended threshold %d%%."
#string STR_DIAGNOSTIC_CONTROLLER_TEMP_EXCEEDS_ALARM_THR  #language en "The quick health check detected that Apache Pass DIMM %ls is reporting a core temperature of %d C which is above the alarm threshold %d C."
#string STR_DIAGNOSTIC_VIRAL_STATE  #language en "The quick health check detected that Apache Pass DIMM %ls is reporting a viral state. The Apache Pass DIMM is now read - only."
#string STR_DIAGNOSTIC_NO_SPARE_DIE_AVAILABLE  #language en "The quick health check detected that Apache Pass DIMM %ls is reporting that it has 0 spare die available."
#string STR_DIAGNOSTIC_AIT_DRAM_NOT_READY  #language en "The quick health check detected that the firmware on Apache Pass DIMM %ls is reporting that the AIT Dram is not ready."
#string STR_DIAGNOSTIC_AIT_DRAM_DISABLED  #language en "The quick health check detected that the firmware on Apache Pass DIMM %ls is reporting that the AIT Dram is disabled."
#string STR_DIAGNOSTIC_FW_LOAD_FAILED  #language en "The quick health check detected that the firmware on Apache Pass DIMM %ls failed to load successfully."
#string STR_DIAGNOSTIC_BSR_NOT_READABLE  #language en "The quick health check detected that the boot status register of Apache Pass DIMM %ls is not readable."
#string STR_DIAGNOSTIC_BSR_FW_ASSERT  #language en "The quick health check detected that the firmware on Apache Pass DIMM %ls reported an assert."
#string STR_DIAGNOSTIC_BSR_DDRT_IO_NOT_COMPLETE  #language en "Critical: AEP DIMM %ls is reporting that the DDRT IO Init is not complete."
#string STR_DIAGNOSTIC_BSR_MAILBOX_NOT_READY  #language en "Critical: AEP DIMM %ls is reporting that the mailbox interface is not ready."
#string STR_DIAGNOSTIC_BSR_MEDIA_ERROR  #language en "The quick health check detected that the firmware on Apache Pass DIMM %ls is reporting an error in the media."
#string STR_DIAGNOSTIC_BSR_MEDIA_NOT_READY  #language en "The quick health check detected that the firmware on Apache Pass DIMM %ls is reporting that the media is not ready."
#string STR_DIAGNOSTIC_BSR_MEDIA_DISABLED  #language en "The quick health check detected that the firmware on Apache Pass DIMM %ls is reporting that the media is disabled."
#string STR_DIAGNOSTIC_BSR_MEDIA_ENGINE_STALLED  #language en "The quick health check detected that the firmware on Apache Pass DIMM %ls has stalled the media interface engine."
#string STR_DIAGNOSTIC_BSR_FW_NOT_INITIALIZED  #language en "The quick health check detected that the firmware on Apache Pass DIMM %ls has not initialized successfully, last known Major : Minor Checkpoint is 0x%x:0x%x."
#string STR_DIAGNOSTIC_BSR_CPU_EXCEPTION  #language en "Critical: Firmware on AEP DIMM %ls has an internal CPU error, last known Major:Minor Checkpoint is 0x%x:0x%x."
#string STR_DIAGNOSTIC_BSR_BIOS_POST_TRAINING_FAILED  #language en "The quick health check detected that Apache Pass DIMM %ls failed to initialize BIOS POST testing."
#string STR_DIAGNOSTIC_QUICK_ABORTED_DIMM_INTERNAL_ERROR  #language en "Info: An internal error caused the quick health check to abort on AEP DIMM %ls."
#string STR_DIAGNOSTIC_CONFIG_SUCCESS  #language en "The platform configuration check succeeded."
#string STR_DIAGNOSTIC_CONFIG_DUPLICATE_DIMM_UID  #language en "The platform configuration check detected %d DIMMs installed on the platform with the same serial number %ls."
#string STR_DIAGNOSTIC_CONFIG_NO_OS_PROVISIONING  #language en "The platform configuration check detected that the BIOS settings do not currently allow memory provisioning from this software."
#string STR_DIAGNOSTIC_CONFIG_DIMM_FAILED_TO_INITIALIZE  #language en "The platform configuration check detected that an Apache Pass DIMM with physical ID 0x%04x is present in the system but failed to initialize."
#string STR_DIAGNOSTIC_CONFIG_UNABLE_TO_READ_NS_INFO  #language en "The platform configuration check was unable to retrieve the namespace information."
#string STR_DIAGNOSTIC_CONFIG_UNABLE_TO_READ_POOL_INFO  #language en "The platform configuration check was unable to retrieve the pool information."
#string STR_DIAGNOSTIC_CONFIG_GOAL_FAILED_FIRMWARE  #language en "The platform configuration check detected that the BIOS could not apply the configuration goal on Apache Pass DIMM %ls because of a firmware error.The detailed status is %ls."
#string STR_DIAGNOSTIC_CONFIG_GOAL_FAILED_DATA  #language en "The platform configuration check detected that the BIOS could not apply the configuration goal on Apache Pass DIMM %ls because of errors in the goal data.The detailed status is %ls."
#string STR_DIAGNOSTIC_CONFIG_GOAL_FAILED_INSUFFICIENT_RESOURCES  #language en "The platform configuration check detected that the BIOS could not apply the configuration goal on Apache Pass DIMM %ls because the system has insufficient resources. The detailed status is %ls."
#string STR_DIAGNOSTIC_CONFIG_GOAL_FAILED_UNKNOWN  #language en "The platform configuration check detected that the BIOS could not apply the configuration goal on Apache Pass DIMM %ls for an unknown reason. The detailed status is %ls."
#string STR_DIAGNOSTIC_CONFIG_DETAILED_STATUS  #language en "COUT table status: (%d), Partition change table status: (%ls), Interleave change table 1 status: (%ls), Interleave change table 2 status: (%ls)"
#string STR_DIAGNOSTIC_CONFIG_IS_BROKEN_DIMMS_MISSING  #language en "The platform configuration check detected that interleave set %d is broken because the Apache Pass DIMM(s) were moved."
#string STR_DIAGNOSTIC_SECURITY_SUCCESS  #language en "The security check succeeded."
#string STR_DIAGNOSTIC_SECURITY_INCONSISTENT  #language en "The security check detected that security settings are inconsistent"
#string STR_DIAGNOSTIC_FW_SUCCESS  #language en "The firmware consistency and settings check succeeded."
#string STR_DIAGNOSTIC_FW_INCONSISTENT  #language en "The firmware consistency and settings check detected that firmware version on Apache Pass DIMMs %ls with part number 0x%04x is nonoptimal, preferred version is %ls."
